In [3]:
import numpy as np
import pandas as pd

In [5]:
# creating a series
s = pd.Series([24,31,np.nan,78,43])
s

0    24.0
1    31.0
2     NaN
3    78.0
4    43.0
dtype: float64

In [8]:
#creating a dataframe
df  = pd.DataFrame({
    "GDP_per": [2,4,6,8],
    "Country": ['India','USA','Japan','China']
    }
)
df.dtypes

GDP_per     int64
Country    object
dtype: object

In [10]:
df.boxplot  #boxplotting the dataframe

<bound method boxplot_frame of    GDP_per Country
0        2   India
1        4     USA
2        6   Japan
3        8   China>

In [11]:
df.head()

   GDP_per Country
0        2   India
1        4     USA
2        6   Japan
3        8   China

In [12]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
df.columns

Index(['GDP_per', 'Country'], dtype='object')

In [14]:
df.describe()

        GDP_per
count  4.000000
mean   5.000000
std    2.581989
min    2.000000
25%    3.500000
50%    5.000000
75%    6.500000
max    8.000000

In [16]:
df2 = pd.read_csv(r"C:\Users\Lenovo\Downloads\StudentsPerformance.csv")
df2.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [21]:
df2.describe()    #statistical summary

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [23]:
df2.iloc[3]

gender                                       male
race/ethnicity                            group A
parental level of education    associate's degree
lunch                                free/reduced
test preparation course                      none
math score                                     47
reading score                                  57
writing score                                  44
Name: 3, dtype: object

In [25]:
df2[df2['gender'] == 'male'].head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
10,male,group C,associate's degree,standard,none,58,54,52

In [29]:
df2.isnull().sum()  #identifying the missing values present in the dataset

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [33]:
df2['math score'].mean()

66.089

In [35]:
df2.groupby(['math score','reading score','writing score']).sum().head(5)  #grouping based on the scores obtained by the student

,,,gender,race/ethnicity,parental level of education,lunch,test preparation course
math score,reading score,writing score,,,,,
0,17,10,female,group C,some high school,free/reduced,none
8,24,23,female,group B,high school,free/reduced,none
18,32,28,female,group B,some high school,free/reduced,none
19,38,32,female,group B,some college,standard,none
22,39,33,female,group C,some college,free/reduced,none